system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.146;

vertices
(

    (0      0     0)     // vertex number  0
    (2      0     0)     // vertex number  1
    (2.1643 0     0)     // vertex number  2
    (5      0     0)     // vertex number  3
    (0      0.032 0)     // vertex number  4
    (2      0.032 0)     // vertex number  5
    (2.1643 0.032 0)     // vertex number  6
    (5      0.032 0)     // vertex number  7
    (0      5     0)     // vertex number  8
    (2      5     0)     // vertex number  9
    (2.1643 5     0)     // vertex number 10
    (5      5     0)     // vertex number 11
    (0      0     0.01)  // vertex number 12
    (2      0     0.01)  // vertex number 13
    (2.1643 0     0.01)  // vertex number 14
    (5      0     0.01)  // vertex number 15
    (0      0.032 0.01)  // vertex number 16
    (2      0.032 0.01)  // vertex number 17
    (2.1643 0.032 0.01)  // vertex number 18
    (5      0.032 0.01)  // vertex number 19
    (0      5     0.01)  // vertex number 20
    (2      5     0.01)  // vertex number 12
    (2.1643 5     0.01)  // vertex number 22
    (5      5     0.01)  // vertex number 23


);

blocks
(
    hex (0 1 5 4 12 13 17 16) (23 8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (19 8 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (23 42 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (4 42 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (19 42 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
            (2 3 15 14)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);


// ************************************************************************* //
